# 数据规整：聚合合并重塑

In [1]:
import pandas as pd

In [4]:
import numpy as np

In [8]:
data=pd.Series(np.random.randn(9),
              index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]]
              )

In [9]:
data

a  1    1.152048
   2   -1.621713
   3   -0.860668
b  1    0.192783
   3    0.210354
c  1    0.236944
   2   -1.286891
d  2    0.090201
   3   -1.190440
dtype: float64

In [10]:
data1=pd.Series(np.random.randn(9),
              index=[['a','b','c','d','e','f','g','h','d'],[1,2,3,1,3,1,2,2,3]]
              )

In [11]:
data1

a  1    1.820377
b  2    0.381299
c  3   -1.436848
d  1    0.443657
e  3   -0.424882
f  1   -0.307527
g  2    1.934069
h  2    1.738510
d  3   -0.679668
dtype: float64

In [12]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [13]:
data['b':'d']

b  1    0.192783
   3    0.210354
c  1    0.236944
   2   -1.286891
d  2    0.090201
   3   -1.190440
dtype: float64

In [17]:
data.loc[['b','d']]

b  1    0.192783
   3    0.210354
d  2    0.090201
   3   -1.190440
dtype: float64

In [22]:
data.loc['b':'c',1]

b  1    0.192783
c  1    0.236944
dtype: float64

In [23]:
data

a  1    1.152048
   2   -1.621713
   3   -0.860668
b  1    0.192783
   3    0.210354
c  1    0.236944
   2   -1.286891
d  2    0.090201
   3   -1.190440
dtype: float64

In [24]:
data.unstack()

          1         2         3
a  1.152048 -1.621713 -0.860668
b  0.192783       NaN  0.210354
c  0.236944 -1.286891       NaN
d       NaN  0.090201 -1.190440

In [29]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),
                  index=[['a','a','b','b'],[1,2,1,2]],
                  columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [37]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [31]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [33]:
frame.index.names=['key1','key2']

In [36]:
frame.columns.names=['state','color']

In [43]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [46]:
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['state','color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [49]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [54]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [56]:
frame.sum(level=0)

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [57]:
frame.sum(level=1,axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [58]:
frame=pd.DataFrame({'a':range(7),
                   'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[1,1,2,0,1,2,3]})

In [59]:
frame

   a  b    c  d
0  0  7  one  1
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [60]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 1  0  7  one  1
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [61]:
frame2=frame.set_index(['c','d'])

In [62]:
frame2

       a  b
c   d
one 1  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [63]:
frame2.reset_index()

     c  d  a  b
0  one  1  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [64]:
df1=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)})

In [69]:
df2=pd.DataFrame({'key':['b','b','a','b','d'],
                 'data2':range(5)})

In [70]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [71]:
df2

  key  data2
0   b      0
1   b      1
2   a      2
3   b      3
4   d      4

In [72]:
pd.merge(df1,df2,on='key')

   key  data1  data2
0    b      0      0
1    b      0      1
2    b      0      3
3    b      1      0
4    b      1      1
5    b      1      3
6    b      5      0
7    b      5      1
8    b      5      3
9    a      2      2
10   a      4      2

In [73]:
pd.merge(df1,df2,on='key',how='outer')

   key  data1  data2
0    b    0.0    0.0
1    b    0.0    1.0
2    b    0.0    3.0
3    b    1.0    0.0
4    b    1.0    1.0
5    b    1.0    3.0
6    b    5.0    0.0
7    b    5.0    1.0
8    b    5.0    3.0
9    a    2.0    2.0
10   a    4.0    2.0
11   c    3.0    NaN
12   d    NaN    4.0

In [74]:
pd.merge(df1,df2,on='key',how='inner')

   key  data1  data2
0    b      0      0
1    b      0      1
2    b      0      3
3    b      1      0
4    b      1      1
5    b      1      3
6    b      5      0
7    b      5      1
8    b      5      3
9    a      2      2
10   a      4      2

In [75]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c'],
                 'value':range(6)})

In [78]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [84]:
right1=pd.DataFrame({'group_val':[3.5,7]},
                 index=['a','b'])

In [85]:
right1

   group_val
a        3.5
b        7.0

In [87]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [88]:
lefth=pd.DataFrame({'key1':['ohio','ohio','ohio','nevada','nevada'],
                   'key2':[2000,2001,2002,2001,2002],
                   'data':np.arange(5.0)})

In [90]:
righth=pd.DataFrame(np.arange(12).reshape((6,2)),
                   index=[['nevada','nevada','ohio','ohio','ohio','ohio'],[2001,2000,2000,2000,2001,2002]],
                   columns=['event1','event2'])

In [91]:
lefth

     key1  key2  data
0    ohio  2000   0.0
1    ohio  2001   1.0
2    ohio  2002   2.0
3  nevada  2001   3.0
4  nevada  2002   4.0

In [92]:
righth

             event1  event2
nevada 2001       0       1
       2000       2       3
ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [95]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    ohio  2000   0.0       4       5
0    ohio  2000   0.0       6       7
1    ohio  2001   1.0       8       9
2    ohio  2002   2.0      10      11
3  nevada  2001   3.0       0       1

In [102]:
s1=pd.Series([0,1], index=['a','b'])

In [103]:
s2=pd.Series([2,3,4], index=['c','d','e'])

In [104]:
s3=pd.Series([5,6], index=['f','g'])

In [105]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [111]:
result=pd.concat([s1,s2,s3], keys=['one','two','three'])

In [112]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [113]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [117]:
pd.concat([s1,s2,s3], keys=['one','two','three'], axis=1, sort=False)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [118]:
df1=pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'],columns=['one','two'])

In [119]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [120]:
df2=pd.DataFrame(5+np.arange(4).reshape(2,2), index=['a','c'],columns=['three','four'])

In [121]:
df2

   three  four
a      5     6
c      7     8

In [125]:
pd.concat([df1,df2],keys=['level1','level2'],axis=1,sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [128]:
pd.concat([df1,df2],keys=['level1','level2'],axis=1,names=['upper','lower'],sort=False)

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [132]:
pd.Index(['ohio','colorado'],name='state')

Index(['ohio', 'colorado'], dtype='object', name='state')

In [134]:
data=pd.DataFrame(np.arange(6).reshape(2,3), index=pd.Index(['ohio','colorado'],name='state'),
                  columns=pd.Index(['one','two','three'],name='number'))

In [135]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [136]:
re=data.stack()

In [137]:
re

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [139]:
re.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [140]:
re.unstack(1)

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [141]:
re.unstack(0)

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [144]:
re

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [142]:
df=pd.DataFrame({'left':re,'right':re+5})

In [143]:
df

                 left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [145]:
df=pd.DataFrame({'left':re,'right':re+5},
               columns=pd.Index(['left','right'],
                               name='side'))

In [146]:
df

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [147]:
df.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [148]:
df.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7